УТ_для_edt/src/Catalogs/смартКвалификацииМенеджеров/смартКвалификацииМенеджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартКвалификацииМенеджеров</name>
  <comment>//++ #1543 смарт: Фролов 10.11.2023 //Автоматическое распределение лидов на менеджеров</comment>
  <predefined>
    <items>
      <name>РегистрацияПользователяНаСайте</name>
      <description>Регистрация пользователя на сайте</description>
    </items>
  </predefined>
  <attributes>
    <name>СценарийИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтартовыйЭтап</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРеакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодВзаимодействияСКлиентом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродукта</name>
    <type>
      <types>CatalogRef.смартТипыПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПродажиВПрошлыхПеридах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоЛидовВДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУслуги</name>
    <comment>//++ #1748 смарт: Саломадин 05.04.2024 //Переход на единую воронку</comment>
    <type>
      <types>CatalogRef.CRM_ТипУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Сортировка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеПроверятьНаличиеТоваров</name>
    <comment>//++ #Б-1198 смарт: Фролов 24.10.2024 //Исключение некоторых квалификаций из условий обязательного указания товаров в ТЧ товары</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеАктуальна</name>
    <comment>//++ #Б-4442 смарт: Фролов 30.09.2025 //Доработка механизма Квалификаций менеджеров.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбучения</name>
    <comment>//++ #Б-4944 смарт: Фролов 07.11.2025 //Доработка справочника Оборудование клиентов/Квалификации менеджеров.</comment>
    <type>
      <types>EnumRef.смартВидыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОценки</name>
    <comment>//++ #Б-4944 смарт: Фролов 07.11.2025 //Доработка справочника Оборудование клиентов/Квалификации менеджеров.</comment>
    <type>
      <types>EnumRef.смартВариантыОценкиОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>КвалификацияОбучения</name>
    <comment>//++ #Б-4944 смарт: Фролов 07.11.2025 //Доработка справочника Оборудование клиентов/Квалификации менеджеров.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукты</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыНоменклатуры</name>
    <attributes>
      <name>ГруппаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиРассылок</name>
    <comment>//++ #1738 смарт: Фролов 02.04.2024 //Добавляем дополнительных получателей рассыки по квалификации.</comment>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Enums/CRM_ВидыСостоянияИнтереса/CRM_ВидыСостоянияИнтереса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыСостоянияИнтереса</name>
  <enumValues>
    <name>Первое</name>
  </enumValues>
  <enumValues>
    <name>УспешноеЗавершение</name>
  </enumValues>
  <enumValues>
    <name>НеудачноеЗавершение</name>
  </enumValues>
  <enumValues>
    <name>смартКвалификация</name>
    <comment>//++ #1698 смарт: Фролов 27.03.2024 //Оповещение Маркетинга и Коммерции о результатах обработки интереса менеджером.</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/смартКвалификацииМенеджеров/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ОтобразитьДекорациюТипаПродукта();
	
	Если НЕ Пользователи.РолиДоступны("смартДобавлениеИзменениеКвалификацийМенеджеров") ТОгда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
		
	ТаблицаДляКоэффициентов = смартСервер.СформироватьВыдачуЛидовПоКвалификации(ТекущийОбъект.Ссылка);

	смартСервер.ЗаполнитьКоэффициентыМенеджеров(ТаблицаДляКоэффициентов);
	
	смартСервер.ОчиститьКоэффициентыИВыдачуЛидов();
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура СценарийИнтересаПриИзмененииНаСервере()
	Запрос=Новый Запрос("ВЫБРАТЬ
					|	CRM_СостоянияИнтересов.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
					|ГДЕ
					|	CRM_СостоянияИнтересов.Родитель = &Родитель
					|	И CRM_СостоянияИнтересов.ВидСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСостоянияИнтереса.Первое)");
	Запрос.УстановитьПараметр("Родитель",Объект.СценарийИнтереса);
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() ТОгда
		Объект.СтартовыйЭтап=Выборка.Ссылка;	
	Иначе
		Объект.СценарийИнтереса=Неопределено;
		ОбщегоНазначения.СообщитьПользователю("Не найден стартовый этап для сценария!");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
					|	смартКвалификацииПродукты.Ссылка.Ссылка КАК Квалификация
					|ИЗ
					|	Справочник.смартКвалификацииМенеджеров.Продукты КАК смартКвалификацииПродукты
					|ГДЕ
					|	смартКвалификацииПродукты.Продукт = &Продукт
					|	И НЕ смартКвалификацииПродукты.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	Для Каждого СтрПродукт Из Объект.Продукты Цикл
		Запрос.УстановитьПараметр("Продукт",СокрЛП(СтрПродукт.Продукт));
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() ТОгда
			ОбщегоНазначения.СообщитьПользователю("Продукт "+СтрПродукт.Продукт+" уже присутствует в квалификации "+Выборка.Квалификация+"!");
			Отказ=Истина;
		КонецЕсли;	
	КонецЦикла;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СценарийИнтересаПриИзменении(Элемент)
	СценарийИнтересаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтобразитьДекорациюТипаПродукта()
	Если ЗначениеЗаполнено(Объект.ТипПродукта) Тогда
		Если Объект.ТипПродукта.АнализироватьПродукт Тогда
			ЭтаФорма.Элементы.ДекорацияДляТипаПродукта.Заголовок="Распределение производится по продукту";
		Иначе
			ЭтаФорма.Элементы.ДекорацияДляТипаПродукта.Заголовок="Однозначный тип продукта, товары не влияют на распределение.";
		КонецЕсли;
	Иначе
		ЭтаФорма.Элементы.ДекорацияДляТипаПродукта.Заголовок="";
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ТипПродуктаПриИзменении(Элемент)
	ОтобразитьДекорациюТипаПродукта();
КонецПроцедуры
